---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures
source: html/9c8cc989-83ea-b8f0-c4e3-6ba8e9e7eac3.htm
---
# BuiltInFailures.OpeningFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.